currency_name = "Спасибо"

choose_city_text = """Привет!
Чтобы начать, отправь мне код игры"""

email_text = """Для начала регистрации отправь мне свой email"""

greeting_text = """Добро пожаловать в Экосистему благодарностей от Молодёжных акселераторов Сбера 😎

Для подключения нужен уникальный ник, по которому тебе будут отправлять благодарности другие участники.

Шаг 1
Придумай свою уникальную комбинацию ника:
- Длина: 3–6 букв/цифр (например, БЛАГО)
- Регистр букв ника не важен (БлагО = БЛАГО)

Шаг 2
Напиши мне эту комбинацию следующим сообщением со звездочкой в начале:
❕*БЛАГО❕

Если ник уже занят, мы попросим тебя выбрать другой. Ждём 👇"""

reg_kip_not_available = "К сожалению, этот код уже занят. Попробуй другой!"

reg_already_registered = "Кажется, ты уже зарегистрирован, разве нет?"

#registration_failed

reg_success = """Поздравляю, ты успешно подключился к системе обмена благодарностями!

Для отправки спасибо отправь мне ник получателя (например, ты благодаришь игрока БАНК) и размер благодарности (например 1 спасибо)

То есть, твой перевод мог бы выглядеть вот так:
банк 10

Ты также можешь оставить комментарий в переводу во второй строке, вот так:
БАНК 10
Спасибо тебе, банк!

После каждой транзакции тебе будет также показываться твой баланс)"""

settings = """⚙️ Настройки ⚙️

Аноним: включи, если хочешь, чтобы твой телеграм не показывался отправителям и получателям (будет показан только твой код)

* to be continued *

Если написано ON, то настройка активна"""

faq_topup = """Для пополнения аккаунта надо найти наших агентов.
Ты узнаешь их по белой ромашке!
Также ты можешь написать @svillvs. Но мы больше любим живое общение :)

Пополнение, как и переводы, происходит без комиссии. 
1 EasyCoin = 1 всемирная монета. 
Никаких сложных конвертаций :)


При большой сумме пополнения пользователь может получить интересный неденежный бонус. Об этом спрашивай у нас лично :)"""

faq_transactions = """Для перевода отправь мне код пользователя и сумму. Вот так:
DUROV
12345

Или в одну строчку:
DUROV 12345

Комиссия отсутствует при всех переводах: любому игроку, в любой регион, любая сумма.

Переводить можно только целые числа: дробные будут округляться. 
Отрицательные суммы, очевидно, перевести невозможно, но ты можешь попробовать всё:)"""

faq_currency = """EasyCoin привязан к общемировой монете:
1 EasyCoin = 1 всемирная монета. 
Никаких сложных конвертаций :)
Актуальный курс валют ты можешь найти в нашем информационном канале и узнать у экономики.

EasyCoin — валюта, независимая от остальных, включая криптовалюты и иные аналоги денежных средств. Пользователи всех стран, ролей, финансового положения равны. Система доступна всем.

Обеспечение EasyCoin происходит реальными деньгами, которые были получены системой от пользователей (в приоритете наличные средства, так как они не зависят от банковской системы).
Все бонусы, которые мы предоставляем, подкреплены заложенным бюджетом от владельцев и заинтересованных партнёров. Дополнительной эмиссии не происходит. 
"""

faq_change_code = """Код позволяет переводить деньги именно вам по красивому имени.

К одному ТГ может быть привязан только один код. Но ты можешь создавать доп. аккаунты с другого ТГ!

Для изменения кода пиши @easy_CEO. Не злоупотребляй этим, лучше выбирай с умом :)"""

faq_chargeback = """Если ты ошибочно сделал перевод и получатель отказывается вернуть деньги, пиши @svillvs с объяснением.

При дальнейшей жалобе получателя или злоупотреблении данной опцией аккаунт может быть заморожен или удалён, так что лучше вопросы решать самим."""

faq_bug = """Если ты нашел какой-то баг или фичу, которая мешает тебе или которая может нанести вред другим пользователям, обратись к @easy_CEO. Мы щедры на вознаграждения в подобных ситуациях :)

Мелкие ошибки, вроде грамматических, нам также интересны и будут исправлены по вашему запросу в обмен на бонусики :)

Если ты загорелся найти что-нибудь эдакое, то вперёд, мы будем рады сделать систему ещё лучше!

Не нашёл ответа на свой вопрос? Интересно узнать больше, предложить сотрудничество или просто узнать ещё больше? Пиши @svillvs или подходи к нашим агентам поболтать!"""